In [1]:
import pandas as pd

In [2]:
raw_file = pd.read_csv(r'Downloads/raw_data.csv') # importing the csv file
raw_file

,ADDR,Unnamed: 1,Unnamed: 2,DT,NAME,time
0,"45 rd, kenith street, btm, bangalore 500038",NaN,NaN,03-04-2022,abc,8:30:21
1,"45 rd, street, hitech, Hd 500038",NaN,NaN,02-04-2022,dec,5:30:21

In [3]:
raw_file = raw_file.loc[:, ~raw_file.columns.str.startswith('Unnamed')] # removed unnamed features
raw_file

                                          ADDR          DT NAME     time
0  45 rd, kenith street, btm, bangalore 500038  03-04-2022  abc  8:30:21
1            45 rd,  street, hitech, Hd 500038  02-04-2022  dec  5:30:21

# understanding the structure of dataset

In [4]:
raw_file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ADDR    2 non-null      object
 1   DT      2 non-null      object
 2   NAME    2 non-null      object
 3   time    2 non-null      object
dtypes: object(4)
memory usage: 196.0+ bytes

In [5]:
raw_file.describe()

                                               ADDR          DT NAME     time
count                                             2           2    2        2
unique                                            2           2    2        2
top     45 rd, kenith street, btm, bangalore 500038  03-04-2022  abc  8:30:21
freq                                              1           1    1        1

# splitting the features

In [6]:
# splitting the adress feature
raw_file[['Road','Street','Area','City']]=raw_file['ADDR'].str.split(',',expand=True)
raw_file.head()

C:\Users\acer\AppData\Local\Temp\ipykernel_4184\3475290164.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  raw_file[['Road','Street','Area','City']]=raw_file['ADDR'].str.split(',',expand=True)

,ADDR,DT,NAME,time,Road,Street,Area,City
0,"45 rd, kenith street, btm, bangalore 500038",03-04-2022,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038
1,"45 rd, street, hitech, Hd 500038",02-04-2022,dec,5:30:21,45 rd,street,hitech,Hd 500038

In [7]:
# droped the ADDR feature
raw_file = raw_file.drop(columns=['ADDR'])
raw_file.head()

           DT NAME     time   Road          Street     Area               City
0  03-04-2022  abc  8:30:21  45 rd   kenith street      btm   bangalore 500038
1  02-04-2022  dec  5:30:21  45 rd          street   hitech          Hd 500038

In [8]:
# splitting the time feature
raw_file[['Hour', 'Minute', 'Second']] = raw_file['time'].str.split(':', expand=True)
raw_file.head()

,DT,NAME,time,Road,Street,Area,City,Hour,Minute,Second
0,03-04-2022,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038,8,30,21
1,02-04-2022,dec,5:30:21,45 rd,street,hitech,Hd 500038,5,30,21

In [9]:
# splitting the DT feature
raw_file[['Day', 'Month', 'Year']] = raw_file['DT'].str.split('-', expand=True)
raw_file.head()

,DT,NAME,time,Road,Street,Area,City,Hour,Minute,Second,Day,Month,Year
0,03-04-2022,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038,8,30,21,03,04,2022
1,02-04-2022,dec,5:30:21,45 rd,street,hitech,Hd 500038,5,30,21,02,04,2022

In [11]:
# finding missing values
raw_file.isnull().sum()

DT        0
NAME      0
time      0
Road      0
Street    0
Area      0
City      0
Hour      0
Minute    0
Second    0
Day       0
Month     0
Year      0
dtype: int64

There are no missing values in the dataset

In [12]:
# saving the cleaned file
raw_file.to_csv('cleaned_file.csv',index=False)